### Experiment 3 - Problem 2

In [13]:
import pandas as pd #import pandas library

cars = pd.read_csv("cars.csv") #load the .csv file into a data frame named cars using pandas

# For Letter A
cars.iloc[:,::2].head() # Use iloc to get your desired columns to display, specifically the columns that are odd-numbered.
# : to display all rows
# ::2 to start at the beginning and step by 2.

               Model  cyl   hp     wt  vs  gear
0          Mazda RX4    6  110  2.620   0     4
1      Mazda RX4 Wag    6  110  2.875   0     4
2         Datsun 710    4   93  2.320   1     4
3     Hornet 4 Drive    6  110  3.215   1     3
4  Hornet Sportabout    8  175  3.440   0     3

In [15]:
# For letter B.
cars.loc[cars['Model']=='Mazda RX4']

       Model   mpg  cyl   disp   hp  drat    wt   qsec  vs  am  gear  carb
0  Mazda RX4  21.0    6  160.0  110   3.9  2.62  16.46   0   1     4     4

In [21]:
# For letter C.
cars.loc[cars['Model']=='Camaro Z28', ['Model','cyl']]

         Model  cyl
23  Camaro Z28    8

In [19]:
# For letter D.
models = ('Mazda RX4 Wag','Ford Pantera L','Honda Civic') # Set up a tuple for the models of the cars
cars.loc[cars['Model'].isin(models),['Model','cyl','gear']] # Use the .isin() function so that it can identify the elements of the variable in the dataframe.

             Model  cyl  gear
1    Mazda RX4 Wag    6     4
18     Honda Civic    4     4
28  Ford Pantera L    8     5